[
  {
    "origin": "OpenCV: Why Graph API?",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Why Graph API?",
    "local": ""
  },
  {
    "origin": "Motivation behind G-API",
    "local": ""
  },
  {
    "origin": "G-API module brings graph-based model of execution to OpenCV. This chapter briefly describes how this new model can help software developers in two aspects: optimizing and porting image processing algorithms.",
    "local": ""
  },
  {
    "origin": "Optimizing with Graph API",
    "local": ""
  },
  {
    "origin": "Traditionally OpenCV provided a lot of stand-alone image processing functions (see modules",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "). Many of that functions are well-optimized (e.g. vectorized for specific CPUs, parallel, etc) but still the out-of-box optimization scope has been limited to a single function only &ndash; optimizing the whole algorithm built atop of that functions was a responsibility of a programmer.",
    "local": ""
  },
  {
    "origin": "OpenCV 3.0 introduced",
    "local": ""
  },
  {
    "origin": "Transparent API",
    "local": ""
  },
  {
    "origin": "(or",
    "local": ""
  },
  {
    "origin": "T-API",
    "local": ""
  },
  {
    "origin": ") which allowed to offload OpenCV function calls transparently to OpenCL devices and save on Host/Device data transfers with",
    "local": ""
  },
  {
    "origin": "&ndash; and it was a great step forward. However, T-API is a dynamic API &ndash; user code still remains unconstrained and OpenCL kernels are enqueued in arbitrary order, thus eliminating further pipeline-level optimization potential.",
    "local": ""
  },
  {
    "origin": "G-API brings implicit graph model to OpenCV 4.0. Graph model captures all operations and its data dependencies in a pipeline and so provides G-API framework with extra information to do pipeline-level optimizations.",
    "local": ""
  },
  {
    "origin": "The cornerstone of graph-based optimizations is",
    "local": ""
  },
  {
    "origin": "Tiling",
    "local": ""
  },
  {
    "origin": ". Tiling allows to break the processing into smaller parts and reorganize operations to enable data parallelism, improve data locality, and save memory footprint. Data locality is an especially important aspect of software optimization due to diffent costs of memory access on modern computer architectures &ndash; the more data is reused in the first level cache, the more efficient pipeline is.",
    "local": ""
  },
  {
    "origin": "Definitely the aforementioned techniques can be applied manually &ndash; but it requires extra skills and knowledge of the target platform and the algorithm implementation changes irrevocably &ndash; becoming more specific, less flexible, and harder to extend and maintain.",
    "local": ""
  },
  {
    "origin": "G-API takes this responsibility and complexity from user and does the majority of the work by itself, keeping the algorithm code clean from device or optimization details. This approach has its own limitations, though, as graph model is a",
    "local": ""
  },
  {
    "origin": "constrained",
    "local": ""
  },
  {
    "origin": "model and not every algorithm can be represented as a graph, so the G-API scope is limited only to regular image processing &ndash; various filters, arithmetic, binary operations, and well-defined geometrical transformations.",
    "local": ""
  },
  {
    "origin": "Porting with Graph API",
    "local": ""
  },
  {
    "origin": "The essence of G-API is declaring a sequence of operations to run, and then executing that sequence. G-API is a constrained API, so it puts a number of limitations on which operations can form a pipeline and which data these operations may exchange each other.",
    "local": ""
  },
  {
    "origin": "This formalization in fact helps to make an algorithm portable. G-API clearly separates operation",
    "local": ""
  },
  {
    "origin": "interfaces",
    "local": ""
  },
  {
    "origin": "from its",
    "local": ""
  },
  {
    "origin": "implementations",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "One operation (",
    "local": ""
  },
  {
    "origin": "kernel",
    "local": ""
  },
  {
    "origin": ") may have multiple implementations even for a single device (e.g., OpenCV-based \"reference\" implementation and a tiled optimized implementation, both running on CPU). Graphs (or",
    "local": ""
  },
  {
    "origin": "Computations",
    "local": ""
  },
  {
    "origin": "in G-API terms) are built only using operation interfaces, not implementations &ndash; thus the same graph can be executed on different devices (and, of course, using different optimization techniques) with little-to-no changes in the graph itself.",
    "local": ""
  },
  {
    "origin": "G-API supports plugins (",
    "local": ""
  },
  {
    "origin": "Backends",
    "local": ""
  },
  {
    "origin": ") which aggregate logic and intelligence on what is the best way to execute on a particular platform. Once a pipeline is built with G-API, it can be parametrized to use either of the backends (or a combination of it) and so a graph can be ported easily to a new platform.",
    "local": ""
  },
  {
    "origin": "See also",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:33 for OpenCV by &#160;",
    "local": ""
  }
]