[
  {
    "origin": "OpenCV: Saliency API",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Classes",
    "local": ""
  },
  {
    "origin": "Saliency API",
    "local": ""
  },
  {
    "origin": "Classes",
    "local": ""
  },
  {
    "origin": "the Fast Self-tuning Background Subtraction",
    "local": ""
  },
  {
    "origin": "from",
    "local": ""
  },
  {
    "origin": "More...",
    "local": ""
  },
  {
    "origin": "algorithms based on [3] [3] Cheng, Ming-Ming, et al. \"BING: Binarized normed gradients for objectness estimation at 300fps.\" IEEE CVPR. 2014.",
    "local": ""
  },
  {
    "origin": "More...",
    "local": ""
  },
  {
    "origin": "the Fine Grained",
    "local": ""
  },
  {
    "origin": "approach from",
    "local": ""
  },
  {
    "origin": "More...",
    "local": ""
  },
  {
    "origin": "the Spectral Residual approach from",
    "local": ""
  },
  {
    "origin": "More...",
    "local": ""
  },
  {
    "origin": "Detailed Description",
    "local": ""
  },
  {
    "origin": "Many computer vision applications may benefit from understanding where humans focus given a scene. Other than cognitively understanding the way human perceive images and scenes, finding salient regions and objects in the images helps various tasks such as speeding up object detection, object recognition, object tracking and content-aware image editing.",
    "local": ""
  },
  {
    "origin": "About the saliency, there is a rich literature but the development is very fragmented. The principal purpose of this API is to give a unique interface, a unique framework for use and plug sever saliency algorithms, also with very different nature and methodology, but they share the same purpose, organizing algorithms into three main categories:",
    "local": ""
  },
  {
    "origin": "Static Saliency**: algorithms belonging to this category, exploit different image features that allow to detect salient objects in a non dynamic scenarios.",
    "local": ""
  },
  {
    "origin": "Motion Saliency**: algorithms belonging to this category, are particularly focused to detect salient objects over time (hence also over frame), then there is a temporal component sealing cosider that allows to detect \"moving\" objects as salient, meaning therefore also the more general sense of detection the changes in the scene.",
    "local": ""
  },
  {
    "origin": "Objectness**:",
    "local": ""
  },
  {
    "origin": "is usually represented as a value which reflects how likely an image window covers an object of any category. Algorithms belonging to this category, avoid making decisions early on, by proposing a small number of category-independent proposals, that are expected to cover all objects in an image. Being able to perceive objects before identifying them is closely related to bottom up visual attention (saliency).",
    "local": ""
  },
  {
    "origin": "Saliency diagram",
    "local": ""
  },
  {
    "origin": "To see how API works, try tracker demo:",
    "local": ""
  },
  {
    "origin": "https://github.com/fpuja/opencv_contrib/blob/saliencyModuleDevelop/modules/saliency/samples/computeSaliency.cpp",
    "local": ""
  },
  {
    "origin": "Note",
    "local": ""
  },
  {
    "origin": "This API has been designed with PlantUML. If you modify this API please change UML.",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:41 for OpenCV by &#160;",
    "local": ""
  }
]