[
  {
    "origin": "OpenCV: Image Processing",
    "local": "OpenCV：图像处理"
  },
  {
    "origin": "Open Source Computer Vision",
    "local": "开源计算机视觉"
  },
  {
    "origin": "Image Processing",
    "local": "图像处理"
  },
  {
    "origin": "Learn how to change images between different color spaces.",
    "local": "了解如何在不同颜色空间之间更改图像。"
  },
  {
    "origin": "Learn how to apply different geometric transformations to images like rotation, translation etc.",
    "local": "学习如何对图像应用不同的几何变换，如旋转、平移等。"
  },
  {
    "origin": "Learn how to convert images to binary images using global thresholding, Adaptive thresholding, Otsu's binarization etc.",
    "local": "学习如何使用全局阈值、自适应阈值、大津二值化等将图像转换为二值图像。"
  },
  {
    "origin": "Learn how to blur the images, filter the images with custom kernels etc.",
    "local": "学习如何模糊图像，用自定义内核过滤图像等。"
  },
  {
    "origin": "Learn about morphological transformations like Erosion, Dilation, Opening, Closing etc.",
    "local": "学习形态变化，如侵蚀，扩张，打开，关闭等。"
  },
  {
    "origin": "Learn how to find image gradients, edges etc.",
    "local": "学习如何找到图像的梯度，边缘等。"
  },
  {
    "origin": "Learn how to find edges with Canny Edge Detection.",
    "local": "学习如何找到边缘与精明的边缘检测。"
  },
  {
    "origin": "Learn about image pyramids and how to use them for image blending.",
    "local": "了解图像金字塔以及如何使用它们进行图像混合。"
  },
  {
    "origin": "Learn about Contours in OpenCV.js.",
    "local": "了解OpenCV.js中的轮廓。"
  },
  {
    "origin": "Learn about histograms in OpenCV.js.",
    "local": "了解OpenCV.js中的直方图。"
  },
  {
    "origin": "Learn different Image Transforms in OpenCV.js like Fourier Transform, Cosine Transform etc.",
    "local": "学习OpenCV.js中不同的图像变换，如傅立叶变换、余弦变换等。"
  },
  {
    "origin": "Learn how to search for an object in an image using Template Matching.",
    "local": "了解如何使用模板匹配在图像中搜索对象。"
  },
  {
    "origin": "Learn how to detect lines in an image.",
    "local": "学习如何检测图像中的线条。"
  },
  {
    "origin": "Learn how to detect circles in an image.",
    "local": "了解如何检测图像中的圆。"
  },
  {
    "origin": "Learn how to segment images with watershed segmentation.",
    "local": "学习如何使用分水岭分割分割图像。"
  },
  {
    "origin": "Learn how to extract foreground with GrabCut algorithm.",
    "local": "学习如何用GrabCut算法提取前景。"
  },
  {
    "origin": "Learn image processing for video capture.",
    "local": "学习视频捕获的图像处理。"
  },
  {
    "origin": "Learn how to use IntelligentScissors tool for image segmentation task.",
    "local": "了解如何使用图像分割任务的智能剪刀工具。"
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:37 for OpenCV by &#160;",
    "local": "2021年4月2日星期五11:36:37为OpenCV生成，&#160；"
  }
]