[
  {
    "origin": "OpenCV: Capture Gray code pattern tutorial",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Capture Gray code pattern tutorial",
    "local": ""
  },
  {
    "origin": "Goal",
    "local": ""
  },
  {
    "origin": "In this tutorial you will learn how to use the",
    "local": ""
  },
  {
    "origin": "GrayCodePattern",
    "local": ""
  },
  {
    "origin": "class to:",
    "local": ""
  },
  {
    "origin": "Generate a Gray code pattern.",
    "local": ""
  },
  {
    "origin": "Project the Gray code pattern.",
    "local": ""
  },
  {
    "origin": "Capture the projected Gray code pattern.",
    "local": ""
  },
  {
    "origin": "It is important to underline that",
    "local": ""
  },
  {
    "origin": "GrayCodePattern",
    "local": ""
  },
  {
    "origin": "class actually implements the 3DUNDERWORLD algorithm described in",
    "local": ""
  },
  {
    "origin": ", which is based on a stereo approach: we need to capture the projected pattern at the same time from two different views if we want to reconstruct the 3D model of the scanned object. Thus, an acquisition set consists of the images captured by each camera for each image in the pattern sequence.",
    "local": ""
  },
  {
    "origin": "Code",
    "local": ""
  },
  {
    "origin": "Explanation",
    "local": ""
  },
  {
    "origin": "First of all the pattern images to project must be generated. Since the number of images is a function of the projector's resolution,",
    "local": ""
  },
  {
    "origin": "GrayCodePattern",
    "local": ""
  },
  {
    "origin": "class parameters must be set with our projector's width and height. In this way the",
    "local": ""
  },
  {
    "origin": "generate",
    "local": ""
  },
  {
    "origin": "method can be called: it fills a vector of Mat with the computed pattern images:",
    "local": ""
  },
  {
    "origin": "For example, using the default projector resolution (1024 x 768), 40 images have to be projected: 20 for regular color pattern (10 images for the columns sequence and 10 for the rows one) and 20 for the color-inverted pattern, where the inverted pattern images are images with the same structure as the original but with inverted colors. This provides an effective method for easily determining the intensity value of each pixel when it is lit (highest value) and when it is not lit (lowest value) during the decoding step.",
    "local": ""
  },
  {
    "origin": "Subsequently, to identify shadow regions, the regions of two images where the pixels are not lit by projector's light and thus where there is not code information, the 3DUNDERWORLD algorithm computes a shadow mask for the two cameras views, starting from a white and a black images captured by each camera. So two additional images need to be projected and captured with both cameras:",
    "local": ""
  },
  {
    "origin": "Thus, the final projection sequence is projected as follows: first the column and its inverted sequence, then the row and its inverted sequence and finally the white and black images.",
    "local": ""
  },
  {
    "origin": "Once the pattern images have been generated, they must be projected using the full screen option: the images must fill all the projection area, otherwise the projector full resolution is not exploited, a condition on which is based 3DUNDERWORLD implementation.",
    "local": ""
  },
  {
    "origin": "At this point the images can be captured with our digital cameras, using libgphoto2 library, recently included in OpenCV: remember to turn on gPhoto2 option in Cmake.list when building OpenCV.",
    "local": ""
  },
  {
    "origin": "The two cameras must work at the same resolution and must have autofocus option disabled, maintaining the same focus during all acquisition. The projector can be positioned in the middle of the cameras.",
    "local": ""
  },
  {
    "origin": "However, before to proceed with pattern acquisition, the cameras must be calibrated. Once the calibration is performed, there should be no movement of the cameras, otherwise a new calibration will be needed.",
    "local": ""
  },
  {
    "origin": "After having connected the cameras and the projector to the computer, cap_pattern demo can be launched giving as parameters the path where to save the images, and the projector's width and height, taking care to use the same focus and cameras settings of calibration.",
    "local": ""
  },
  {
    "origin": "At this point, to acquire the images with both cameras, the user can press any key.",
    "local": ""
  },
  {
    "origin": "If the captured images are good (the user must take care that the projected pattern is viewed from the two cameras), the user can save them pressing the enter key, otherwise pressing any other key he can take another shot.",
    "local": ""
  },
  {
    "origin": "The acquistion ends when all the pattern images have saved for both cameras. Then the user can reconstruct the 3D model of the captured scene using the",
    "local": ""
  },
  {
    "origin": "decode",
    "local": ""
  },
  {
    "origin": "method of",
    "local": ""
  },
  {
    "origin": "GrayCodePattern",
    "local": ""
  },
  {
    "origin": "class (see next tutorial).",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:39 for OpenCV by &#160;",
    "local": ""
  }
]