[
  {
    "origin": "OpenCV: Histogram - 4 : Histogram Backprojection",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Histogram - 4 : Histogram Backprojection",
    "local": ""
  },
  {
    "origin": "Goal",
    "local": ""
  },
  {
    "origin": "In this chapter, we will learn about histogram backprojection.",
    "local": ""
  },
  {
    "origin": "Theory",
    "local": ""
  },
  {
    "origin": "It was proposed by",
    "local": ""
  },
  {
    "origin": "Michael J. Swain , Dana H. Ballard",
    "local": ""
  },
  {
    "origin": "in their paper",
    "local": ""
  },
  {
    "origin": "Indexing via color histograms",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "What is it actually in simple words?",
    "local": ""
  },
  {
    "origin": "It is used for image segmentation or finding objects of interest in an image. In simple words, it creates an image of the same size (but single channel) as that of our input image, where each pixel corresponds to the probability of that pixel belonging to our object. In more simpler words, the output image will have our object of interest in more white compared to remaining part. Well, that is an intuitive explanation. (I can't make it more simpler). Histogram Backprojection is used with camshift algorithm etc.",
    "local": ""
  },
  {
    "origin": "How do we do it ?",
    "local": ""
  },
  {
    "origin": "We create a histogram of an image containing our object of interest (in our case, the ground, leaving player and other things). The object should fill the image as far as possible for better results. And a color histogram is preferred over grayscale histogram, because color of the object is a better way to define the object than its grayscale intensity. We then \"back-project\" this histogram over our test image where we need to find the object, ie in other words, we calculate the probability of every pixel belonging to the ground and show it. The resulting output on proper thresholding gives us the ground alone.",
    "local": ""
  },
  {
    "origin": "Algorithm in Numpy",
    "local": ""
  },
  {
    "origin": "First we need to calculate the color histogram of both the object we need to find (let it be 'M') and the image where we are going to search (let it be 'I').",
    "local": ""
  },
  {
    "origin": "Find the ratio \\(R = \\frac{M}{I}\\). Then backproject R, ie use R as palette and create a new image with every pixel as its corresponding probability of being target. ie B(x,y) = R[h(x,y),s(x,y)] where h is hue and s is saturation of the pixel at (x,y). After that apply the condition \\(B(x,y) = min[B(x,y), 1]\\).",
    "local": ""
  },
  {
    "origin": "Now apply a convolution with a circular disc, \\(B = D \\ast B\\), where D is the disc kernel.",
    "local": ""
  },
  {
    "origin": "Now the location of maximum intensity gives us the location of object. If we are expecting a region in the image, thresholding for a suitable value gives a nice result.",
    "local": ""
  },
  {
    "origin": "That's it !!",
    "local": ""
  },
  {
    "origin": "Backprojection in OpenCV",
    "local": ""
  },
  {
    "origin": "OpenCV provides an inbuilt function",
    "local": ""
  },
  {
    "origin": ". Its parameters are almost same as the",
    "local": ""
  },
  {
    "origin": "function. One of its parameter is histogram which is histogram of the object and we have to find it. Also, the object histogram should be normalized before passing on to the backproject function. It returns the probability image. Then we convolve the image with a disc kernel and apply threshold. Below is my code and output :",
    "local": ""
  },
  {
    "origin": "Below is one example I worked with. I used the region inside blue rectangle as sample object and I wanted to extract the full ground.",
    "local": ""
  },
  {
    "origin": "image",
    "local": ""
  },
  {
    "origin": "Additional Resources",
    "local": ""
  },
  {
    "origin": "Exercises",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:37 for OpenCV by &#160;",
    "local": ""
  }
]