[
  {
    "origin": "OpenCV: Detection of ArUco Markers",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Detection of ArUco Markers",
    "local": ""
  },
  {
    "origin": "Pose estimation is of great importance in many computer vision applications: robot navigation, augmented reality, and many more. This process is based on finding correspondences between points in the real environment and their 2d image projection. This is usually a difficult step, and thus it is common to use synthetic or fiducial markers to make it easier.",
    "local": ""
  },
  {
    "origin": "One of the most popular approaches is the use of binary square fiducial markers. The main benefit of these markers is that a single marker provides enough correspondences (its four corners) to obtain the camera pose. Also, the inner binary codification makes them specially robust, allowing the possibility of applying error detection and correction techniques.",
    "local": ""
  },
  {
    "origin": "The aruco module is based on the",
    "local": ""
  },
  {
    "origin": "ArUco library",
    "local": ""
  },
  {
    "origin": ", a popular library for detection of square fiducial markers developed by Rafael Muñoz and Sergio Garrido:",
    "local": ""
  },
  {
    "origin": "S. Garrido-Jurado, R. Muñoz-Salinas, F. J. Madrid-Cuevas, and M. J. Marín-Jiménez. 2014. \"Automatic generation and detection of highly reliable fiducial markers under occlusion\". Pattern Recogn. 47, 6 (June 2014), 2280-2292. DOI=10.1016/j.patcog.2014.01.005",
    "local": ""
  },
  {
    "origin": "The aruco functionalities are included in:",
    "local": ""
  },
  {
    "origin": "Markers and Dictionaries",
    "local": ""
  },
  {
    "origin": "An ArUco marker is a synthetic square marker composed by a wide black border and an inner binary matrix which determines its identifier (id). The black border facilitates its fast detection in the image and the binary codification allows its identification and the application of error detection and correction techniques. The marker size determines the size of the internal matrix. For instance a marker size of 4x4 is composed by 16 bits.",
    "local": ""
  },
  {
    "origin": "Some examples of ArUco markers:",
    "local": ""
  },
  {
    "origin": "Example of markers images",
    "local": ""
  },
  {
    "origin": "It must be noted that a marker can be found rotated in the environment, however, the detection process needs to be able to determine its original rotation, so that each corner is identified unequivocally. This is also done based on the binary codification.",
    "local": ""
  },
  {
    "origin": "A dictionary of markers is the set of markers that are considered in a specific application. It is simply the list of binary codifications of each of its markers.",
    "local": ""
  },
  {
    "origin": "The main properties of a dictionary are the dictionary size and the marker size.",
    "local": ""
  },
  {
    "origin": "The dictionary size is the number of markers that compose the dictionary.",
    "local": ""
  },
  {
    "origin": "The marker size is the size of those markers (the number of bits).",
    "local": ""
  },
  {
    "origin": "The aruco module includes some predefined dictionaries covering a range of different dictionary sizes and marker sizes.",
    "local": ""
  },
  {
    "origin": "One may think that the marker id is the number obtained from converting the binary codification to a decimal base number. However, this is not possible since for high marker sizes the number of bits is too high and managing such huge numbers is not practical. Instead, a marker id is simply the marker index within the dictionary it belongs to. For instance, the first 5 markers in a dictionary have the ids: 0, 1, 2, 3 and 4.",
    "local": ""
  },
  {
    "origin": "More information about dictionaries is provided in the \"Selecting a dictionary\" section.",
    "local": ""
  },
  {
    "origin": "Marker Creation",
    "local": ""
  },
  {
    "origin": "Before their detection, markers need to be printed in order to be placed in the environment. Marker images can be generated using the",
    "local": ""
  },
  {
    "origin": "function.",
    "local": ""
  },
  {
    "origin": "For example, lets analyze the following call:",
    "local": ""
  },
  {
    "origin": "First, the",
    "local": ""
  },
  {
    "origin": "object is created by choosing one of the predefined dictionaries in the aruco module. Concretely, this dictionary is composed of 250 markers and a marker size of 6x6 bits (",
    "local": ""
  },
  {
    "origin": ").",
    "local": ""
  },
  {
    "origin": "The parameters of",
    "local": ""
  },
  {
    "origin": "are:",
    "local": ""
  },
  {
    "origin": "The first parameter is the",
    "local": ""
  },
  {
    "origin": "object previously created.",
    "local": ""
  },
  {
    "origin": "The second parameter is the marker id, in this case the marker 23 of the dictionary",
    "local": ""
  },
  {
    "origin": ". Note that each dictionary is composed of a different number of markers. In this case, the valid ids go from 0 to 249. Any specific id out of the valid range will produce an exception.",
    "local": ""
  },
  {
    "origin": "The third parameter, 200, is the size of the output marker image. In this case, the output image will have a size of 200x200 pixels. Note that this parameter should be large enough to store the number of bits for the specific dictionary. So, for instance, you cannot generate an image of 5x5 pixels for a marker size of 6x6 bits (and that is without considering the marker border). Furthermore, to avoid deformations, this parameter should be proportional to the number of bits + border size, or at least much higher than the marker size (like 200 in the example), so that deformations are insignificant.",
    "local": ""
  },
  {
    "origin": "The fourth parameter is the output image.",
    "local": ""
  },
  {
    "origin": "Finally, the last parameter is an optional parameter to specify the width of the marker black border. The size is specified proportional to the number of bits. For instance a value of 2 means that the border will have a width equivalent to the size of two internal bits. The default value is 1.",
    "local": ""
  },
  {
    "origin": "The generated image is:",
    "local": ""
  },
  {
    "origin": "Generated marker",
    "local": ""
  },
  {
    "origin": "A full working example is included in the",
    "local": ""
  },
  {
    "origin": "inside the module samples folder.",
    "local": ""
  },
  {
    "origin": "Note: The samples now take input from the command line using",
    "local": ""
  },
  {
    "origin": ". For this file the example parameters will look like",
    "local": ""
  },
  {
    "origin": "Marker Detection",
    "local": ""
  },
  {
    "origin": "Given an image containing ArUco markers, the detection process has to return a list of detected markers. Each detected marker includes:",
    "local": ""
  },
  {
    "origin": "The position of its four corners in the image (in their original order).",
    "local": ""
  },
  {
    "origin": "The id of the marker.",
    "local": ""
  },
  {
    "origin": "The marker detection process is comprised of two main steps:",
    "local": ""
  },
  {
    "origin": "Detection of marker candidates. In this step the image is analyzed in order to find square shapes that are candidates to be markers. It begins with an adaptive thresholding to segment the markers, then contours are extracted from the thresholded image and those that are not convex or do not approximate to a square shape are discarded. Some extra filtering is also applied (removing contours that are too small or too big, removing contours too close to each other, etc).",
    "local": ""
  },
  {
    "origin": "After the candidate detection, it is necessary to determine if they are actually markers by analyzing their inner codification. This step starts by extracting the marker bits of each marker. To do so, a perspective transformation is first applied to obtain the marker in its canonical form. Then, the canonical image is thresholded using Otsu to separate white and black bits. The image is divided into different cells according to the marker size and the border size. Then the number of black or white pixels in each cell is counted to determine if it is a white or a black bit. Finally, the bits are analyzed to determine if the marker belongs to the specific dictionary. Error correction techniques are employed when necessary.",
    "local": ""
  },
  {
    "origin": "Consider the following image:",
    "local": ""
  },
  {
    "origin": "Image with an assortment of markers",
    "local": ""
  },
  {
    "origin": "And a printout of this image in a photo:",
    "local": ""
  },
  {
    "origin": "Original image with markers",
    "local": ""
  },
  {
    "origin": "These are the detected markers (in green). Note that some markers are rotated. The small red square indicates the marker’s top left corner.:",
    "local": ""
  },
  {
    "origin": "Image with detected markers",
    "local": ""
  },
  {
    "origin": "And these are the marker candidates that have been rejected during the identification step (in pink):",
    "local": ""
  },
  {
    "origin": "Image with rejected candidates",
    "local": ""
  },
  {
    "origin": "In the aruco module, the detection is performed in the",
    "local": ""
  },
  {
    "origin": "function. This function is the most important in the module, since all the rest of the functionality is based on the detected markers returned by",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "An example of marker detection:",
    "local": ""
  },
  {
    "origin": "The parameters of",
    "local": ""
  },
  {
    "origin": "are:",
    "local": ""
  },
  {
    "origin": "The first parameter is the image containing the markers to be detected.",
    "local": ""
  },
  {
    "origin": "The second parameter is the dictionary object, in this case one of the predefined dictionaries (",
    "local": ""
  },
  {
    "origin": ").",
    "local": ""
  },
  {
    "origin": "The detected markers are stored in the",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "structures:",
    "local": ""
  },
  {
    "origin": "is the list of corners of the detected markers. For each marker, its four corners are returned in their original order (which is clockwise starting with top left). So, the first corner is the top left corner, followed by the top right, bottom right and bottom left.",
    "local": ""
  },
  {
    "origin": "is the list of ids of each of the detected markers in",
    "local": ""
  },
  {
    "origin": ". Note that the returned",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "vectors have the same size.",
    "local": ""
  },
  {
    "origin": "The fourth parameter is the object of type",
    "local": ""
  },
  {
    "origin": ". This object includes all the parameters that can be customized during the detection process. These parameters are explained in the next section.",
    "local": ""
  },
  {
    "origin": "The final parameter,",
    "local": ""
  },
  {
    "origin": ", is a returned list of marker candidates, i.e. shapes that were found and considered but did not contain a valid marker. Each candidate is also defined by its four corners, and its format is the same as the",
    "local": ""
  },
  {
    "origin": "parameter. This parameter can be omitted and is only useful for debugging purposes and for ‘refind’ strategies (see",
    "local": ""
  },
  {
    "origin": ").",
    "local": ""
  },
  {
    "origin": "The next thing you probably want to do after",
    "local": ""
  },
  {
    "origin": "is check that your markers have been correctly detected. Fortunately, the aruco module provides a function to draw the detected markers in the input image, this function is",
    "local": ""
  },
  {
    "origin": ". For example:",
    "local": ""
  },
  {
    "origin": "is the input/output image where the markers will be drawn (it will normally be the same as the image where the markers were detected).",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "are the structures of the detected markers returned by the",
    "local": ""
  },
  {
    "origin": "function.",
    "local": ""
  },
  {
    "origin": "Image with detected markers",
    "local": ""
  },
  {
    "origin": "Note that this function is only provided for visualization and its use can be omitted.",
    "local": ""
  },
  {
    "origin": "With these two functions we can create a basic marker detection loop to detect markers from our camera:",
    "local": ""
  },
  {
    "origin": "Note that some of the optional parameters have been omitted, like the detection parameter object and the output vector of rejected candidates.",
    "local": ""
  },
  {
    "origin": "A full working example is included in the",
    "local": ""
  },
  {
    "origin": "inside the module samples folder.",
    "local": ""
  },
  {
    "origin": "Note: The samples now take input from the command line using",
    "local": ""
  },
  {
    "origin": ". For this file the example parameters will look like",
    "local": ""
  },
  {
    "origin": "Pose Estimation",
    "local": ""
  },
  {
    "origin": "The next thing you probably want to do after detecting the markers is to obtain the camera pose from them.",
    "local": ""
  },
  {
    "origin": "To perform camera pose estimation you need to know the calibration parameters of your camera. These are the camera matrix and distortion coefficients. If you do not know how to calibrate your camera, you can take a look at the",
    "local": ""
  },
  {
    "origin": "function and the Calibration tutorial of OpenCV. You can also calibrate your camera using the aruco module as explained in the",
    "local": ""
  },
  {
    "origin": "Calibration with ArUco and ChArUco",
    "local": ""
  },
  {
    "origin": "tutorial. Note that this only needs to be done once unless the camera optics are modified (for instance changing its focus).",
    "local": ""
  },
  {
    "origin": "In the end, what you get after the calibration is the camera matrix: a matrix of 3x3 elements with the focal distances and the camera center coordinates (a.k.a intrinsic parameters), and the distortion coefficients: a vector of 5 or more elements that models the distortion produced by your camera.",
    "local": ""
  },
  {
    "origin": "When you estimate the pose with ArUco markers, you can estimate the pose of each marker individually. If you want to estimate one pose from a set of markers, use ArUco Boards (see the",
    "local": ""
  },
  {
    "origin": "Detection of ArUco Boards",
    "local": ""
  },
  {
    "origin": "tutorial). Using ArUco boards instead of single markers allows some markers to be occluded.",
    "local": ""
  },
  {
    "origin": "The camera pose with respect to a marker is the 3d transformation from the marker coordinate system to the camera coordinate system. It is specified by rotation and translation vectors (see",
    "local": ""
  },
  {
    "origin": "function for more information).",
    "local": ""
  },
  {
    "origin": "The aruco module provides a function to estimate the poses of all the detected markers:",
    "local": ""
  },
  {
    "origin": "The",
    "local": ""
  },
  {
    "origin": "parameter is the vector of marker corners returned by the",
    "local": ""
  },
  {
    "origin": "function.",
    "local": ""
  },
  {
    "origin": "The second parameter is the size of the marker side in meters or in any other unit. Note that the translation vectors of the estimated poses will be in the same unit",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "are the camera calibration parameters that were created during the camera calibration process.",
    "local": ""
  },
  {
    "origin": "The output parameters",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "are the rotation and translation vectors respectively, for each of the markers in",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "The marker coordinate system that is assumed by this function is placed at the center of the marker with the Z axis pointing out, as in the following image. Axis-color correspondences are X: red, Y: green, Z: blue. Note the axis directions of the rotated markers in this image.",
    "local": ""
  },
  {
    "origin": "Image with axes drawn",
    "local": ""
  },
  {
    "origin": "The aruco module provides a function to draw the axis as in the image above, so pose estimation can be checked:",
    "local": ""
  },
  {
    "origin": "is the input/output image where the markers will be drawn (it will normally be the same image where the markers were detected).",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "are the camera calibration parameters.",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "are the pose parameters for the marker whose axis is to be drawn.",
    "local": ""
  },
  {
    "origin": "The last parameter is the length of the axis, in the same unit as tvec (usually meters).",
    "local": ""
  },
  {
    "origin": "A basic full example for pose estimation from single markers:",
    "local": ""
  },
  {
    "origin": "Sample video:",
    "local": ""
  },
  {
    "origin": "A full working example is included in the",
    "local": ""
  },
  {
    "origin": "inside the module samples folder.",
    "local": ""
  },
  {
    "origin": "Note: The samples now take input from the command line using",
    "local": ""
  },
  {
    "origin": ". For this file the example parameters will look like",
    "local": ""
  },
  {
    "origin": "Selecting a dictionary",
    "local": ""
  },
  {
    "origin": "The aruco module provides the",
    "local": ""
  },
  {
    "origin": "class to represent a dictionary of markers.",
    "local": ""
  },
  {
    "origin": "In addition to the marker size and the number of markers in the dictionary, there is another important dictionary parameter, the inter-marker distance. The inter-marker distance is the minimum distance among its markers and it determines the error detection and correction capabilities of the dictionary.",
    "local": ""
  },
  {
    "origin": "In general, lower dictionary sizes and higher marker sizes increase the inter-marker distance and vice-versa. However, the detection of markers with higher sizes is more complex, due to the higher number of bits that need to be extracted from the image.",
    "local": ""
  },
  {
    "origin": "For instance, if you need only 10 markers in your application, it is better to use a dictionary composed only of those 10 markers than using a dictionary composed of 1000 markers. The reason is that the dictionary composed of 10 markers will have a higher inter-marker distance and, thus, it will be more robust to errors.",
    "local": ""
  },
  {
    "origin": "As a consequence, the aruco module includes several ways to select your dictionary of markers, so that you can increase your system robustness:",
    "local": ""
  },
  {
    "origin": "Predefined dictionaries",
    "local": ""
  },
  {
    "origin": "This is the easiest way to select a dictionary. The aruco module includes a set of predefined dictionaries in a variety of marker sizes and number of markers. For instance:",
    "local": ""
  },
  {
    "origin": "is an example of predefined dictionary of markers with 6x6 bits and a total of 250 markers.",
    "local": ""
  },
  {
    "origin": "From all the provided dictionaries, it is recommended to choose the smallest one that fits your application. For instance, if you need 200 markers of 6x6 bits, it is better to use",
    "local": ""
  },
  {
    "origin": "than",
    "local": ""
  },
  {
    "origin": ". The smaller the dictionary, the higher the inter-marker distance.",
    "local": ""
  },
  {
    "origin": "The list of available predefined dictionaries can be found in the documentation for the",
    "local": ""
  },
  {
    "origin": "enum.",
    "local": ""
  },
  {
    "origin": "Automatic dictionary generation",
    "local": ""
  },
  {
    "origin": "The dictionary can be generated automatically to adjust to the desired number of markers and bits, so that the inter-marker distance is optimized:",
    "local": ""
  },
  {
    "origin": "This will generate a customized dictionary composed of 36 markers of 5x5 bits. The process can take several seconds, depending on the parameters (it is slower for larger dictionaries and higher numbers of bits).",
    "local": ""
  },
  {
    "origin": "Manual dictionary generation",
    "local": ""
  },
  {
    "origin": "Finally, the dictionary can be configured manually, so that any codification can be employed. To do that, the",
    "local": ""
  },
  {
    "origin": "object parameters need to be assigned manually. It must be noted that, unless you have a special reason to do this manually, it is preferable to use one of the previous alternatives.",
    "local": ""
  },
  {
    "origin": "The",
    "local": ""
  },
  {
    "origin": "parameters are:",
    "local": ""
  },
  {
    "origin": "is the array that contains all the information about the marker codes.",
    "local": ""
  },
  {
    "origin": "is the size of each marker dimension (for instance, 5 for markers with 5x5 bits). Finally,",
    "local": ""
  },
  {
    "origin": "is the maximum number of erroneous bits that can be corrected during the marker detection. If this value is too high, it can lead to a high number of false positives.",
    "local": ""
  },
  {
    "origin": "Each row in",
    "local": ""
  },
  {
    "origin": "represents one of the dictionary markers. However, the markers are not stored in their binary form, instead they are stored in a special format to simplify their detection.",
    "local": ""
  },
  {
    "origin": "Fortunately, a marker can be easily transformed to this form using the static method",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "For example:",
    "local": ""
  },
  {
    "origin": "Detector Parameters",
    "local": ""
  },
  {
    "origin": "One of the parameters of",
    "local": ""
  },
  {
    "origin": "function is a",
    "local": ""
  },
  {
    "origin": "object. This object includes all the options that can be customized during the marker detection process.",
    "local": ""
  },
  {
    "origin": "This section describes each detector parameter. The parameters can be classified depending on the process in which they’re involved:",
    "local": ""
  },
  {
    "origin": "Thresholding",
    "local": ""
  },
  {
    "origin": "One of the first steps of the marker detection process is an adaptive thresholding of the input image.",
    "local": ""
  },
  {
    "origin": "For instance, the thresholded image for the sample image used above is:",
    "local": ""
  },
  {
    "origin": "Thresholded image",
    "local": ""
  },
  {
    "origin": "This thresholding can be customized with the following parameters:",
    "local": ""
  },
  {
    "origin": "adaptiveThreshWinSizeMin, adaptiveThreshWinSizeMax, and adaptiveThreshWinSizeStep",
    "local": ""
  },
  {
    "origin": "The",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": "parameters represent the interval where the thresholding window sizes (in pixels) are selected for the adaptive thresholding (see OpenCV",
    "local": ""
  },
  {
    "origin": "function for more details).",
    "local": ""
  },
  {
    "origin": "The parameter",
    "local": ""
  },
  {
    "origin": "indicates the increments of the window size from",
    "local": ""
  },
  {
    "origin": "to",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "For instance, for the values",
    "local": ""
  },
  {
    "origin": "= 5 and",
    "local": ""
  },
  {
    "origin": "= 21 and",
    "local": ""
  },
  {
    "origin": "= 4, there will be 5 thresholding steps with window sizes 5, 9, 13, 17 and 21. On each thresholding image, marker candidates will be extracted.",
    "local": ""
  },
  {
    "origin": "Low values of window size can ‘break’ the marker border if the marker size is too large, causing it to not be detected, as in the following image:",
    "local": ""
  },
  {
    "origin": "Broken marker image",
    "local": ""
  },
  {
    "origin": "On the other hand, values that are too high can produce the same effect if the markers are too small, and it can also reduce the performance. Moreover the process would tend to a global thresholding, losing the adaptive benefits.",
    "local": ""
  },
  {
    "origin": "The simplest case is using the same value for",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": ", which produces a single thresholding step. However, it is usually better to use a range of values for the window size, although many thresholding steps can also reduce the performance considerably.",
    "local": ""
  },
  {
    "origin": "Default values:",
    "local": ""
  },
  {
    "origin": "adaptiveThreshConstant",
    "local": ""
  },
  {
    "origin": "The",
    "local": ""
  },
  {
    "origin": "parameter represents the constant value added in the thresholding operation (see OpenCV",
    "local": ""
  },
  {
    "origin": "function for more details). Its default value is a good option in most cases.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "Contour filtering",
    "local": ""
  },
  {
    "origin": "After thresholding, contours are detected. However, not all contours are considered as marker candidates. They are filtered out in different steps so that contours that are very unlikely to be markers are discarded. The parameters in this section customize this filtering process.",
    "local": ""
  },
  {
    "origin": "It must be noted that in most cases it is a question of balance between detection capacity and performance. All the considered contours will be processed in the following stages, which usually have a higher computational cost. So, it is preferred to discard invalid candidates in this stage than in the later stages.",
    "local": ""
  },
  {
    "origin": "On the other hand, if the filtering conditions are too strict, the real marker contours could be discarded and, hence, not detected.",
    "local": ""
  },
  {
    "origin": "minMarkerPerimeterRate and maxMarkerPerimeterRate",
    "local": ""
  },
  {
    "origin": "These parameters determine the minimum and maximum size of a marker, specifically the minimum and maximum marker perimeter. They are not specified in absolute pixel values, instead they are specified relative to the maximum dimension of the input image.",
    "local": ""
  },
  {
    "origin": "For instance, a image with size 640x480 and a minimum relative marker perimeter of 0.05 will lead to a minimum marker perimeter of 640x0.05 = 32 pixels, since 640 is the maximum dimension of the image. The same applies for the",
    "local": ""
  },
  {
    "origin": "parameter.",
    "local": ""
  },
  {
    "origin": "If the",
    "local": ""
  },
  {
    "origin": "is too low, it can penalize considerably the detection performance since many more contours would be considered for future stages. This penalization is not so noticeable for the",
    "local": ""
  },
  {
    "origin": "parameter, since there are usually many more small contours than big contours. A",
    "local": ""
  },
  {
    "origin": "value of 0 and a",
    "local": ""
  },
  {
    "origin": "value of 4 (or more) will be equivalent to consider all the contours in the image, however this is not recommended for performance reasons.",
    "local": ""
  },
  {
    "origin": "Default values:",
    "local": ""
  },
  {
    "origin": "polygonalApproxAccuracyRate",
    "local": ""
  },
  {
    "origin": "A polygonal approximation is applied to each candidate and only those that approximate to a square shape are accepted. This value determines the maximum error that the polygonal approximation can produce (see",
    "local": ""
  },
  {
    "origin": "function for more information).",
    "local": ""
  },
  {
    "origin": "This parameter is relative to the candidate length (in pixels). So if the candidate has a perimeter of 100 pixels and the value of",
    "local": ""
  },
  {
    "origin": "is 0.04, the maximum error would be 100x0.04=5.4 pixels.",
    "local": ""
  },
  {
    "origin": "In most cases, the default value works fine, but higher error values could be necessary for highly distorted images.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "minCornerDistanceRate",
    "local": ""
  },
  {
    "origin": "Minimum distance between any pair of corners in the same marker. It is expressed relative to the marker perimeter. Minimum distance in pixels is Perimeter * minCornerDistanceRate.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "minMarkerDistanceRate",
    "local": ""
  },
  {
    "origin": "Minimum distance between any pair of corners from two different markers. It is expressed relative to the minimum marker perimeter of the two markers. If two candidates are too close, the smaller one is ignored.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "minDistanceToBorder",
    "local": ""
  },
  {
    "origin": "Minimum distance to any of the marker corners to the image border (in pixels). Markers partially occluded by the image border can be correctly detected if the occlusion is small. However, if one of the corners is occluded, the returned corner is usually placed in a wrong position near the image border.",
    "local": ""
  },
  {
    "origin": "If the position of marker corners is important, for instance if you want to do pose estimation, it is better to discard any markers whose corners are too close to the image border. Elsewhere, it is not necessary.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "Bits Extraction",
    "local": ""
  },
  {
    "origin": "After candidate detection, the bits of each candidate are analyzed in order to determine if they are markers or not.",
    "local": ""
  },
  {
    "origin": "Before analyzing the binary code itself, the bits need to be extracted. To do so, the perspective distortion is removed and the resulting image is thresholded using Otsu threshold to separate black and white pixels.",
    "local": ""
  },
  {
    "origin": "This is an example of the image obtained after removing the perspective distortion of a marker:",
    "local": ""
  },
  {
    "origin": "Perspective removing",
    "local": ""
  },
  {
    "origin": "Then, the image is divided into a grid with the same number of cells as the number of bits in the marker. In each cell, the number of black and white pixels are counted to determine the bit value assigned to the cell (from the majority value):",
    "local": ""
  },
  {
    "origin": "Marker cells",
    "local": ""
  },
  {
    "origin": "There are several parameters that can customize this process:",
    "local": ""
  },
  {
    "origin": "markerBorderBits",
    "local": ""
  },
  {
    "origin": "This parameter indicates the width of the marker border. It is relative to the size of each bit. So, a value of 2 indicates the border has the width of two internal bits.",
    "local": ""
  },
  {
    "origin": "This parameter needs to coincide with the border size of the markers you are using. The border size can be configured in the marker drawing functions such as",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "minOtsuStdDev",
    "local": ""
  },
  {
    "origin": "This value determines the minimum standard deviation of the pixel values to perform Otsu thresholding. If the deviation is low, it probably means that all the square is black (or white) and applying Otsu does not make sense. If this is the case, all the bits are set to 0 (or 1) depending on whether the mean value is higher or lower than 128.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "perspectiveRemovePixelPerCell",
    "local": ""
  },
  {
    "origin": "This parameter determines the number of pixels (per cell) in the obtained image after removing perspective distortion (including the border). This is the size of the red squares in the image above.",
    "local": ""
  },
  {
    "origin": "For instance, let’s assume we are dealing with markers of 5x5 bits and border size of 1 bit (see",
    "local": ""
  },
  {
    "origin": "). Then, the total number of cells/bits per dimension is 5 + 2*1 = 7 (the border has to be counted twice). The total number of cells is 7x7.",
    "local": ""
  },
  {
    "origin": "If the value of",
    "local": ""
  },
  {
    "origin": "is 10, then the size of the obtained image will be 10*7 = 70 -&gt; 70x70 pixels.",
    "local": ""
  },
  {
    "origin": "A higher value of this parameter can improve the bits extraction process (up to some degree), however it can penalize the performance.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "perspectiveRemoveIgnoredMarginPerCell",
    "local": ""
  },
  {
    "origin": "When extracting the bits of each cell, the numbers of black and white pixels are counted. In general, it is not recommended to consider all the cell pixels. Instead it is better to ignore some pixels in the margins of the cells.",
    "local": ""
  },
  {
    "origin": "The reason for this is that, after removing the perspective distortion, the cells’ colors are, in general, not perfectly separated and white cells can invade some pixels of black cells (and vice-versa). Thus, it is better to ignore some pixels just to avoid counting erroneous pixels.",
    "local": ""
  },
  {
    "origin": "For instance, in the following image:",
    "local": ""
  },
  {
    "origin": "Marker cell margins",
    "local": ""
  },
  {
    "origin": "only the pixels inside the green squares are considered. It can be seen in the right image that the resulting pixels contain a lower amount of noise from neighbor cells. The",
    "local": ""
  },
  {
    "origin": "parameter indicates the difference between the red and the green squares.",
    "local": ""
  },
  {
    "origin": "This parameter is relative to the total size of the cell. For instance if the cell size is 40 pixels and the value of this parameter is 0.1, a margin of 40*0.1=4 pixels is ignored in the cells. This means that the total number of pixels that would be analyzed in each cell would actually be 32x32, instead of 40x40.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "Marker identification",
    "local": ""
  },
  {
    "origin": "After the bits have been extracted, the next step is checking whether the extracted code belongs to the marker dictionary and, if necessary, error correction can be performed.",
    "local": ""
  },
  {
    "origin": "maxErroneousBitsInBorderRate",
    "local": ""
  },
  {
    "origin": "The bits of the marker border should be black. This parameter specifies the allowed number of erroneous bits in the border, i.e. the maximum number of white bits in the border. It is represented relative to the total number of bits in the marker.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "errorCorrectionRate",
    "local": ""
  },
  {
    "origin": "Each marker dictionary has a theoretical maximum number of bits that can be corrected (",
    "local": ""
  },
  {
    "origin": "). However, this value can be modified by the",
    "local": ""
  },
  {
    "origin": "parameter.",
    "local": ""
  },
  {
    "origin": "For instance, if the allowed number of bits that can be corrected (for the used dictionary) is 6 and the value of",
    "local": ""
  },
  {
    "origin": "is 0.5, the real maximum number of bits that can be corrected is 6*0.5=3 bits.",
    "local": ""
  },
  {
    "origin": "This value is useful to reduce the error correction capabilities in order to avoid false positives.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "Corner Refinement",
    "local": ""
  },
  {
    "origin": "After markers have been detected and identified, the last step is performing subpixel refinement of the corner positions (see OpenCV",
    "local": ""
  },
  {
    "origin": "and",
    "local": ""
  },
  {
    "origin": ").",
    "local": ""
  },
  {
    "origin": "Note that this step is optional and it only makes sense if the positions of the marker corners have to be accurate, for instance for pose estimation. It is usually a time-consuming step and therefore is disabled by default.",
    "local": ""
  },
  {
    "origin": "cornerRefinementMethod",
    "local": ""
  },
  {
    "origin": "This parameter determines whether the corner subpixel process is performed or not and which method to use if it is being performed. It can be disabled if accurate corners are not necessary. Possible values are",
    "local": ""
  },
  {
    "origin": ",",
    "local": ""
  },
  {
    "origin": ",",
    "local": ""
  },
  {
    "origin": ", and",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "cornerRefinementWinSize",
    "local": ""
  },
  {
    "origin": "This parameter determines the window size of the subpixel refinement process.",
    "local": ""
  },
  {
    "origin": "High values can produce the effect that close image corners are included in the window region, so that the marker corner moves to a different and wrong location during the process. Furthermore it can affect performance.",
    "local": ""
  },
  {
    "origin": "Default value:",
    "local": ""
  },
  {
    "origin": "cornerRefinementMaxIterations and cornerRefinementMinAccuracy",
    "local": ""
  },
  {
    "origin": "These two parameters determine the stop criteria of the subpixel refinement process. The",
    "local": ""
  },
  {
    "origin": "indicates the maximum number of iterations and",
    "local": ""
  },
  {
    "origin": "the minimum error value before stopping the process.",
    "local": ""
  },
  {
    "origin": "If the number of iterations is too high, it can affect the performance. On the other hand, if it is too low, it can produce a poor subpixel refinement.",
    "local": ""
  },
  {
    "origin": "Default values:",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:38 for OpenCV by &#160;",
    "local": ""
  }
]