[
  {
    "origin": "OpenCV: Trackbar as the Color Palette",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Trackbar as the Color Palette",
    "local": ""
  },
  {
    "origin": "Goal",
    "local": ""
  },
  {
    "origin": "Learn to bind trackbar to OpenCV windows",
    "local": ""
  },
  {
    "origin": "You will learn these functions :",
    "local": ""
  },
  {
    "origin": ",",
    "local": ""
  },
  {
    "origin": "etc.",
    "local": ""
  },
  {
    "origin": "Code Demo",
    "local": ""
  },
  {
    "origin": "Here we will create a simple application which shows the color you specify. You have a window which shows the color and three trackbars to specify each of B,G,R colors. You slide the trackbar and correspondingly window color changes. By default, initial color will be set to Black.",
    "local": ""
  },
  {
    "origin": "For",
    "local": ""
  },
  {
    "origin": "function, first argument is the trackbar name, second one is the window name to which it is attached, third argument is the default value, fourth one is the maximum value and fifth one is the callback function which is executed every time trackbar value changes. The callback function always has a default argument which is the trackbar position. In our case, function does nothing, so we simply pass.",
    "local": ""
  },
  {
    "origin": "Another important application of trackbar is to use it as a button or switch. OpenCV, by default, doesn't have button functionality. So you can use trackbar to get such functionality. In our application, we have created one switch in which application works only if switch is ON, otherwise screen is always black.",
    "local": ""
  },
  {
    "origin": "The screenshot of the application looks like below :",
    "local": ""
  },
  {
    "origin": "image",
    "local": ""
  },
  {
    "origin": "Exercises",
    "local": ""
  },
  {
    "origin": "Create a Paint application with adjustable colors and brush radius using trackbars. For drawing, refer previous tutorial on mouse handling.",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:37 for OpenCV by &#160;",
    "local": ""
  }
]