[
  {
    "origin": "OpenCV: Add a Trackbar to Your Application",
    "local": ""
  },
  {
    "origin": "Open Source Computer Vision",
    "local": ""
  },
  {
    "origin": "Add a Trackbar to Your Application",
    "local": ""
  },
  {
    "origin": "Goal",
    "local": ""
  },
  {
    "origin": "Use HTML DOM Input Range Object to add a trackbar to your application.",
    "local": ""
  },
  {
    "origin": "Code Demo",
    "local": ""
  },
  {
    "origin": "Here, we will create a simple application that blends two images. We will let the user enter the weight by using the trackbar.",
    "local": ""
  },
  {
    "origin": "First, we need to create three canvas elements: two for input and one for output. Please refer to the tutorial",
    "local": ""
  },
  {
    "origin": ".",
    "local": ""
  },
  {
    "origin": "Then, we use HTML DOM Input Range Object to implement the trackbar, which is shown as below.",
    "local": ""
  },
  {
    "origin": "Note",
    "local": ""
  },
  {
    "origin": "&lt;input&gt; elements with type=\"range\" are not supported in Internet Explorer 9 and earlier versions.",
    "local": ""
  },
  {
    "origin": "You can create an &lt;input&gt; element with type=\"range\" with the document.createElement() method:",
    "local": ""
  },
  {
    "origin": "You can access an &lt;input&gt; element with type=\"range\" with getElementById():",
    "local": ""
  },
  {
    "origin": "As a trackbar, the range element need a trackbar name, the default value, minimum value, maximum value, step and the callback function which is executed every time trackbar value changes. The callback function always has a default argument, which is the trackbar position. Additionally, a text element to display the trackbar value is fine. In our case, we can create the trackbar as below:",
    "local": ""
  },
  {
    "origin": "Finally, we can use the trackbar value in the callback function, blend the two images, and display the result.",
    "local": ""
  },
  {
    "origin": "See also",
    "local": ""
  },
  {
    "origin": "Try it",
    "local": ""
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:37 for OpenCV by &#160;",
    "local": ""
  }
]