[
  {
    "origin": "OpenCV: Multi-camera Calibration",
    "local": "OpenCV:多摄像机校准"
  },
  {
    "origin": "Open Source Computer Vision",
    "local": "开源计算机视觉"
  },
  {
    "origin": "Multi-camera Calibration",
    "local": "多摄像机标定"
  },
  {
    "origin": "This tutorial will show how to use the multiple camera calibration toolbox. This toolbox is based on the usage of \"random\" pattern calibration object, so the tutorial is mainly two parts: an introduction to \"random\" pattern and multiple camera calibration.",
    "local": "本教程将演示如何使用多摄像机校准工具箱。这个工具箱是基于“随机”模式校准对象的使用，所以本教程主要分为两个部分：介绍“随机”模式和多摄像机校准。"
  },
  {
    "origin": "Random Pattern Calibration Object",
    "local": "随机模式校准对象"
  },
  {
    "origin": "The random pattern is an image that is randomly generated. It is \"random\" so that it has many feature points. After generating it, one print it out and use it as a calibration object. The following two images are random pattern and a photo taken for it.",
    "local": "随机图案是随机生成的图像。它是“随机的”，所以它有许多特征点。生成后，打印出来作为校准对象。以下两张图片是随机图案和为其拍摄的照片。"
  },
  {
    "origin": "image",
    "local": "形象"
  },
  {
    "origin": "image",
    "local": "形象"
  },
  {
    "origin": "To generate a random pattern, use the class",
    "local": "要生成随机模式，请使用"
  },
  {
    "origin": "in",
    "local": "在里面"
  },
  {
    "origin": "module. Run it as",
    "local": "模块。按以下方式运行"
  },
  {
    "origin": "Here",
    "local": "在这里"
  },
  {
    "origin": "and",
    "local": "和"
  },
  {
    "origin": "are width and height of pattern image. After getting the pattern, print it out and take some photos of it.",
    "local": "图案图像的宽度和高度。拿到图案后，打印出来，拍几张照片。"
  },
  {
    "origin": "Now we can use these images to calibrate camera. First,",
    "local": "现在我们可以用这些图像来校准相机。第一，"
  },
  {
    "origin": "and",
    "local": "和"
  },
  {
    "origin": "need to be detected. Use class",
    "local": "需要检测。使用类"
  },
  {
    "origin": "to detect them. A sample code can be",
    "local": "去发现它们。示例代码可以是"
  },
  {
    "origin": "Here variable",
    "local": "Here变量"
  },
  {
    "origin": "and",
    "local": "和"
  },
  {
    "origin": "are physical pattern width and height with some user defined unit.",
    "local": "是具有用户定义单位的物理图案宽度和高度。"
  },
  {
    "origin": "is a vector of images that stores calibration images.",
    "local": "是存储校准图像的图像矢量。"
  },
  {
    "origin": "Second, use calibration functions like",
    "local": "第二，使用校准功能，如"
  },
  {
    "origin": "or",
    "local": "或"
  },
  {
    "origin": "to calibrate camera.",
    "local": "校准摄像机。"
  },
  {
    "origin": "Multiple Cameras Calibration",
    "local": "多摄像机标定"
  },
  {
    "origin": "Now we move to multiple camera calibration, so far this toolbox must use random pattern object.",
    "local": "现在我们转到多摄像机校准，到目前为止，这个工具箱必须使用随机模式对象。"
  },
  {
    "origin": "To calibrate multiple cameras, we first need to take some photos of random pattern. Of cause, to calibrate the extrinsic parameters, one pattern need to be viewed by multiple cameras (at least two) at the same time. Another thing is that to help the program know which camera and which pattern the photo is taken, the image file should be named as \"cameraIdx-timestamp.*\". Photos with same timestamp means that they are the same object taken by several cameras. In addition, cameraIdx should start from 0. Some examples of files names are \"0-129.png\", \"0-187.png\", \"1-187\", \"2-129\".",
    "local": "为了校准多个摄像机，我们首先需要拍摄一些随机模式的照片。当然，要校准外部参数，需要多个摄像头（至少两个）同时查看一个图案。另一件事是，为了帮助程序知道拍摄照片的相机和模式，应该将图像文件命名为“cameraIdx timestamp.*”。具有相同时间戳的照片意味着它们是由多个相机拍摄的相同对象。此外，cameraIdx应该从0开始。文件名的示例有“0-129.png”、“0-187.png”、“1-187”、“2-129”。"
  },
  {
    "origin": "Then, we can run multiple cameras calibration as",
    "local": "然后，我们可以运行多个摄像机作为校准"
  },
  {
    "origin": "Here",
    "local": "在这里"
  },
  {
    "origin": "indicates the camera type,",
    "local": "指示摄像机类型，"
  },
  {
    "origin": "and",
    "local": "和"
  },
  {
    "origin": "are supported. For omnidirectional camera, you can refer to",
    "local": "支持。对于全向相机，您可以参考"
  },
  {
    "origin": "module for detail.",
    "local": "详细信息模块。"
  },
  {
    "origin": "is the number of camers.",
    "local": "是摄影机数。"
  },
  {
    "origin": "is the name of a file generated by",
    "local": "由生成的文件的名称"
  },
  {
    "origin": "from",
    "local": "从"
  },
  {
    "origin": ". It stores names of random pattern and calibration images, the first file name is the name of random pattern.",
    "local": ". 它存储随机模式和校准图像的名称，第一个文件名是随机模式的名称。"
  },
  {
    "origin": "and",
    "local": "和"
  },
  {
    "origin": "are physical width and height of pattern.",
    "local": "是图案的实际宽度和高度。"
  },
  {
    "origin": "is a flags to indicate whether show feature extraction process.",
    "local": "是一个标志，用于指示是否显示特征提取过程。"
  },
  {
    "origin": "is a minimal points that should be detected in each frame, otherwise this frame will be abandoned.",
    "local": "是每一帧中应该检测到的最小点，否则这一帧将被放弃。"
  },
  {
    "origin": "is a xml file name to store parameters.",
    "local": "是用于存储参数的xml文件名。"
  },
  {
    "origin": "Generated on Fri Apr 2 2021 11:36:38 for OpenCV by &#160;",
    "local": "2021年4月2日星期五11:36:38为OpenCV生成，&#160；"
  }
]